Revit 2026 API

# ExporterIFCRemoveBuildingStorey Method

---

**Note: This API is now obsolete.**

Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
public void RemoveBuildingStorey(
	ElementId id
)
```
```vb
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>
Public Sub RemoveBuildingStorey (
	id As ElementId
)
```
```cpp
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")]
void RemoveBuildingStorey(
	ElementId^ id
)
```
```fsharp
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById instead.")>]
member RemoveBuildingStorey :
        id : ElementId -> unit
```

#### Parameters

id ElementId
     The level id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace